# CM3 Pandas Opdrachten

In dit notebook vind je de volgende opdrachten
- [Opdracht 1 - Series](#Opdracht-1-Series)
- [Opdracht 2 - Dataframe](#Opdracht-2-Dataframe)
- [Opdracht 3 - Cijfers](#Opdracht-3-Cijfers)
- [Opdracht 4 - datetime](#Opdracht-4-datetime)

## Opdracht 1 Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
#values = [7.0, 6.5, 9.0, 8.0]
#index = [ 'DS', 'IAC', 'NET', 'IAC']
values = [7.0, 6.5, 9.0]
index = [ 'DS', 'IAC', 'NET']
cijfers = pd.Series(values, index=index)
cijfers

DS     7.0
IAC    6.5
NET    9.0
dtype: float64

- Haal het cijfer 6.5 op uit de Series door middel van:
  1. de expliciete key methode
  2. de impliciete key methode
  3. rechtstreeks met de expliciete key
  4. rechtstreeks met de impliciete key

- Retourneer de cijfers van de laatste twee vakken uit de Series.

In [5]:
cijfers[["IAC", "NET"]]

IAC    6.5
NET    9.0
dtype: float64

- Bepaal gemiddelde, mediaan, minimum en maximum van de cijfers.

In [15]:
print(cijfers.mean())
print(cijfers.median())
print(cijfers.min())
print(cijfers.max())

7.5
7.0
6.5
9.0

## Opdracht 2 Dataframe

In [68]:
student1 = pd.Series({'Nummer':'s1', 'Naam':'Joop', 'Tentamen':99.9, 'Opdracht': 7.5})
student2 = pd.Series({'Nummer':'s2', 'Naam':'Piet', 'Tentamen':8.0, 'Opdracht': 7.0})
student3 = pd.Series({'Nummer': None, 'Naam':'Fout', 'Tentamen':99.9, 'Opdracht': 99.9})
student4 = pd.Series({'Nummer':'s3', 'Naam':'Kees', 'Tentamen':4.0, 'Opdracht': 6.0})
studenten = pd.DataFrame([student1, student2,student3, student4])
studenten

  Nummer  Naam  Tentamen  Opdracht
0     s1  Joop      99.9       7.5
1     s2  Piet       8.0       7.0
2   None  Fout      99.9      99.9
3     s3  Kees       4.0       6.0

- Bepaal het totaal aantal niet-bestaande waarden.

In [69]:
studenten.isna().sum()

Nummer      1
Naam        0
Tentamen    0
Opdracht    0
dtype: int64

- Zet de opdracht- en tentamencijfers met waarde 99.9 om naar NaN waarde

In [70]:
studenten.replace(99.9, np.nan, inplace=True)
studenten

  Nummer  Naam  Tentamen  Opdracht
0     s1  Joop       NaN       7.5
1     s2  Piet       8.0       7.0
2   None  Fout       NaN       NaN
3     s3  Kees       4.0       6.0

- Haal de missing values uit het DataFrame

In [71]:
studenten.dropna(inplace=True)
studenten

  Nummer  Naam  Tentamen  Opdracht
1     s2  Piet       8.0       7.0
3     s3  Kees       4.0       6.0

- Zet `Nummer` als index.

In [72]:
studenten.set_index("Nummer")

        Naam  Tentamen  Opdracht
Nummer
s2      Piet       8.0       7.0
s3      Kees       4.0       6.0

- Het eindcijfer van het vak is 70% tentamen en 30% opdracht; voeg dit als kolom `Eindcijfer` toe

In [73]:
studenten["Eindcijfer"] = studenten["Tentamen"] * .7 + studenten["Opdracht"] * .3
studenten

  Nummer  Naam  Tentamen  Opdracht  Eindcijfer
1     s2  Piet       8.0       7.0         7.7
3     s3  Kees       4.0       6.0         4.6

- Bepaal het gemiddelde eindcijfer

In [74]:
studenten["Eindcijfer"].mean()

np.float64(6.1499999999999995)

- Wat geeft `studenten.describe()` weer?

In [76]:
# Dit geeft data weer over de df. 50% is de mediaan.
studenten.describe()

       Tentamen  Opdracht  Eindcijfer
count  2.000000  2.000000    2.000000
mean   6.000000  6.500000    6.150000
std    2.828427  0.707107    2.192031
min    4.000000  6.000000    4.600000
25%    5.000000  6.250000    5.375000
50%    6.000000  6.500000    6.150000
75%    7.000000  6.750000    6.925000
max    8.000000  7.000000    7.700000

- Selecteer alle namen en cijfers van de studenten met een voldoende als eindcijfer.

In [80]:
studenten[studenten["Eindcijfer"] >= 5.5][["Naam", "Tentamen", "Opdracht", "Eindcijfer"]]

   Naam  Tentamen  Opdracht  Eindcijfer
1  Piet       8.0       7.0         7.7

## Opdracht 3 Cijfers

Numpy arrays kunnen alleen uniforme waarden bevatten. Pandas arrays kunnen juist meer bevatten. We doen de opdracht in numpy nu in pandas. Tip: maak gebruik van de cheat sheets!

Aanvullende bron:
-	http://nbviewer.jupyter.org/github/justmarkham/pandas-videos/blob/master/pandas.ipynb

De blokcoördinator D.O. Cent van blok A, SIE-V2  wil graag de cijfers analyseren en verwerken. het blok bestaat uit 3 vakken, die door 10 studenten gevolgd zijn. Analyse omvat o.a. het bepalen van gemiddelde cijfer, het aantal voldoendes en cursusrendement. De verwerking bestaat uit het corrigeren van de cijfers. 


In `blokAcijfers.txt` staan de cijfers per vak (naast elkaar staan de vakken, onder elkaar de studenten):

vak1 | vak2 | vak3
----|-------|------
6.5 | 7.3   | 6.4
8.0 | 8.0	| 8.5
3.2	| 4.0	| 5.0
7.9	| 7.1	| 3.5
7.3	| 7.8	| 8.0
8.6	| 8.0	| 9.0
4.0	| 6.0	| 5.5
7.3	| 7.8	| 7.8
4.5	| 5.6	| 7.7
5.0	| 7.0	| 7.2

In `blokAStudenten.csv` staan de studentgegevens:

"Studentnr"|"Naam"|"Vooropleiding"
--|--|--
1502000|"Jan Jansen"|"HAVO"
1501677|"Ali ElMoune"|"MBO"
1503190|"Bert de Graaf"|"HAVO"
1506700|"Koos Alberts"|"MBO"
1504503|"Willie Napoli"|"MBO"
1507878|"Jorrit Beeks"|"VWO"
1502507|"Frits Wielenga"|"HAVO"
1503684|"Cornee Nijsten"|"VWO"
1503831|"Sabine Honing"|"HAVO"
1506001|"George Belfore"|"HAVO"

In [181]:
# Deze imports zijn nodig voor de opdracht.
import pandas as pd
import numpy as np

De docent wil de gegevens in een Jupyter Notebook verwerken.
-	Lees tekstbestand: blokAcijfers.txt in, in een dataframe `cijfers`.
-	Laat zien dat de gegevens goed ingelezen zijn.
-	Wijzig de kolomnrs in de vaknamen: vakken = ['RAD','ANA', CBA'].
-	Toon de dataframe attributen.
-	Toon de index gegevens.

In [182]:
cijfers = pd.read_csv("blokAcijfers.txt", delimiter="\t")

In [183]:
cijfers.columns = ['RAD','ANA', 'CBA']
cijfers

   RAD  ANA  CBA
0  8.0  8.0  8.5
1  3.2  4.0  5.0
2  7.9  7.1  3.5
3  7.3  7.8  8.0
4  8.6  8.0  9.0
5  4.0  6.0  5.5
6  7.3  7.8  7.8
7  4.5  5.6  7.7
8  5.0  7.0  7.2

De docent ziet dat er 2 cijfers fout zijn en wil deze corrigeren (NB. Elke regel heeft een numeriek index gelijk aan het regelnummer.)
-	 Wijzig de volgende cijfers							
    *	vak-2, student-3  cijfer 4.0 moet 4.3 worden.
    *	vak-1, student-10, cijfer 5.0 moet 4.8 worden.

In [184]:
cijfers.at[1, "ANA"] = 4.3
cijfers.at[8, "RAD"] = 4.8
cijfers

   RAD  ANA  CBA
0  8.0  8.0  8.5
1  3.2  4.3  5.0
2  7.9  7.1  3.5
3  7.3  7.8  8.0
4  8.6  8.0  9.0
5  4.0  6.0  5.5
6  7.3  7.8  7.8
7  4.5  5.6  7.7
8  4.8  7.0  7.2

De docent wil de studentgegevens ook aan het dataframe toevoegen.
-	Lees tekstbestand: `blokAStudenten.csv` in, in een dataframe `studenten`. Let op dat je de juiste instellingen voor sep en header meegeeft.
-	Laat zien dat de gegevens correct zijn ingelezen.

In [185]:
studenten = pd.read_csv("blokAStudenten.csv", delimiter=";")
studenten

   Studentnr            Naam Vooropleiding
0    1502000      Jan Jansen          HAVO
1    1501677     Ali ElMoune           MBO
2    1503190   Bert de Graaf          HAVO
3    1506700    Koos Alberts           MBO
4    1504503   Willie Napoli           MBO
5    1507878    Jorrit Beeks           VWO
6    1502507  Frits Wielenga          HAVO
7    1503684  Cornee Nijsten           VWO
8    1503831   Sabine Honing          HAVO
9    1506001  George Belfore          HAVO

Nu gaan we ``studenten`` en ``cijfers`` samenvoegen tot een cijferslijst. We mogen er vanuitgaan dat de volgorde van beiden dezelfde index hebben (hier de rijwaarde 0 t/m 9).
-	Combineer de beide dataframes met behulp van `p.merge()`:
    *	Je kunt hier een inner join gebruiken.
    *	Je kunt van beide zijden de index gebruiken .
-	Laat zien dat de gegevens correct zijn samengevoegd tot één dataframe cijferlijst met de kolommen: `Studentnr`; `Naam`; `Vooropleiding`; `RAD`; `ANA`; en `CBA`.

In [186]:
studenten = studenten.join(cijfers)
studenten

   Studentnr            Naam Vooropleiding  RAD  ANA  CBA
0    1502000      Jan Jansen          HAVO  8.0  8.0  8.5
1    1501677     Ali ElMoune           MBO  3.2  4.3  5.0
2    1503190   Bert de Graaf          HAVO  7.9  7.1  3.5
3    1506700    Koos Alberts           MBO  7.3  7.8  8.0
4    1504503   Willie Napoli           MBO  8.6  8.0  9.0
5    1507878    Jorrit Beeks           VWO  4.0  6.0  5.5
6    1502507  Frits Wielenga          HAVO  7.3  7.8  7.8
7    1503684  Cornee Nijsten           VWO  4.5  5.6  7.7
8    1503831   Sabine Honing          HAVO  4.8  7.0  7.2
9    1506001  George Belfore          HAVO  NaN  NaN  NaN

Het is handig om een dataframe een sprekende index te geven:
-	Maak `Studentnr` de rij-index. NB. Gebruik indien nodig de optie `inplace=True`.

In [187]:
studenten.set_index("Studentnr", inplace=True)
studenten

                     Naam Vooropleiding  RAD  ANA  CBA
Studentnr
1502000        Jan Jansen          HAVO  8.0  8.0  8.5
1501677       Ali ElMoune           MBO  3.2  4.3  5.0
1503190     Bert de Graaf          HAVO  7.9  7.1  3.5
1506700      Koos Alberts           MBO  7.3  7.8  8.0
1504503     Willie Napoli           MBO  8.6  8.0  9.0
1507878      Jorrit Beeks           VWO  4.0  6.0  5.5
1502507    Frits Wielenga          HAVO  7.3  7.8  7.8
1503684    Cornee Nijsten           VWO  4.5  5.6  7.7
1503831     Sabine Honing          HAVO  4.8  7.0  7.2
1506001    George Belfore          HAVO  NaN  NaN  NaN

De docent wil wat basisgegevens: minimum, maximum, gemiddelde van de cijfers weten. Het grote voordeel is dat numpy heel goed kan omgaan met de numerieke kolommen van een dataframe. Voorbeeld: het berekenen van het gemiddelde cijfer voor het vak ‘RAD’ kan met de opdracht: `np.mean(cijferlijst['RAD']`.
-	Bepaal minimum, maximum en gemiddelde van alle cijfers.
-	Bepaal minimum, maximum en gemiddelde van elk vak (3 getallen).
-	Bepaal minimum, maximum en gemiddelde van elke student (10 getallen).

In [188]:
print(cijfers.min())
print(cijfers.max())
print(cijfers.mean())

print(cijfers.min(axis=1))
print(cijfers.max(axis=1))
print(cijfers.mean(axis=1))

RAD    3.2
ANA    4.3
CBA    3.5
dtype: float64
RAD    8.6
ANA    8.0
CBA    9.0
dtype: float64
RAD    6.177778
ANA    6.844444
CBA    6.911111
dtype: float64
0    8.0
1    3.2
2    3.5
3    7.3
4    8.0
5    4.0
6    7.3
7    4.5
8    4.8
dtype: float64
0    8.5
1    5.0
2    7.9
3    8.0
4    9.0
5    6.0
6    7.8
7    7.7
8    7.2
dtype: float64
0    8.166667
1    4.166667
2    6.166667
3    7.700000
4    8.533333
5    5.166667
6    7.633333
7    5.933333
8    6.333333
dtype: float64

Er is een fout gemaakt bij de cijfers van het 1e vak (RAD). Iedere student krijgt 0.5 punt extra erbij.
-	Doe dit met één opdrachtregel.

In [189]:
studenten[["RAD"]] += 0.5
studenten

                     Naam Vooropleiding  RAD  ANA  CBA
Studentnr
1502000        Jan Jansen          HAVO  8.5  8.0  8.5
1501677       Ali ElMoune           MBO  3.7  4.3  5.0
1503190     Bert de Graaf          HAVO  8.4  7.1  3.5
1506700      Koos Alberts           MBO  7.8  7.8  8.0
1504503     Willie Napoli           MBO  9.1  8.0  9.0
1507878      Jorrit Beeks           VWO  4.5  6.0  5.5
1502507    Frits Wielenga          HAVO  7.8  7.8  7.8
1503684    Cornee Nijsten           VWO  5.0  5.6  7.7
1503831     Sabine Honing          HAVO  5.3  7.0  7.2
1506001    George Belfore          HAVO  NaN  NaN  NaN

De docent wil graag weten of er verschil in studentprestaties is afhankelijk van de vooropleiding. 
-	Toon voor elk vak het vooropleiding groepsgemiddelde.
-	Wat is je conclusie ?

In [200]:
s_copy = studenten[["RAD", "ANA", "CBA"]]
mbo = s_copy[studenten["Vooropleiding"] == "MBO"]
havo = s_copy[studenten["Vooropleiding"] == "HAVO"]
vwo = s_copy[studenten["Vooropleiding"] == "VWO"]

mbo_mean = mbo.mean().sum()
havo_mean = havo.mean().sum()
vwo_mean = vwo.mean().sum()

print(f"MBO gemiddelde totaal: {mbo_mean}")
print(f"HAVO gemiddelde totaal: {havo_mean}")
print(f"VWO gemiddelde totaal: {vwo_mean}")

MBO gemiddelde totaal: 20.9
HAVO gemiddelde totaal: 21.725
VWO gemiddelde totaal: 17.15

Conclusie:
HAVO > MBO > VWO

## Opdracht 4 datetime

Maak een Jupyter notebook waarin je met Pandas de volgende casus realiseert: een storingsmedewerker wil graag onderzoeken hoe het weer geweest is op 1 Januari 2017. Hiervoor vraagt hij bij het KNMI de weergegevens op van drie meetstations.

Aanvullende bronnen:
- http://chrisalbon.com/python/pandas_time_series_basics.html
- http://chrisalbon.com/python/date_and_time_basics.html
- http://chrisalbon.com/python/pandas_group_by_time.html

In [266]:
# Aanvullende imports
import datetime as dt
import matplotlib.pyplot as pyplot

# De data die we gaan gebruiken.
data = {'meetpunt': ['De Bilt','Maastricht', 'Leeuwarden',
                     'De Bilt','Maastricht', 'Leeuwarden',
                     'De Bilt','Maastricht', 'Leeuwarden',
                     'De Bilt','Maastricht', 'Leeuwarden'],
        'datum': ['2017-01-01 13:00:05.069722', '2017-01-01 13:00:01.119994', '2017-01-01 13:00:07.178768',
                  '2017-01-02 13:00:01.043200', '2017-01-02 13:00:03.119401', '2017-01-02 13:00:03.876898',
                  '2017-01-03 13:00:03.043450', '2017-01-03 13:00:02.669401', '2017-01-03 13:00:01.321898',
                  '2017-01-04 13:00:04.042015', '2017-01-04 13:00:04.321564', '2017-01-04 13:00:04.394866'],
        'temperatuur': [-0.3, 1.9, 0.8,
                        1.8, 7.1, 5.7,
                        2.9, 7.3, 5.1,
                        0.1, 6.8, 2.1,]}

Bewerk de data zodat deze netjes in een dataframe komt.
-	Maak een dataframe met kolommen: ‘datum’, ‘temperatuur, ‘meetpunt’.
-	Maak van de datum kolom een kolom met datatype datetime.

In [267]:
df = pd.DataFrame(data, columns=["datum", "temperatuur", "meetpunt"])
df["datum"] = pd.to_datetime(df["datum"])
df

                        datum  temperatuur    meetpunt
0  2017-01-01 13:00:05.069722         -0.3     De Bilt
1  2017-01-01 13:00:01.119994          1.9  Maastricht
2  2017-01-01 13:00:07.178768          0.8  Leeuwarden
3  2017-01-02 13:00:01.043200          1.8     De Bilt
4  2017-01-02 13:00:03.119401          7.1  Maastricht
5  2017-01-02 13:00:03.876898          5.7  Leeuwarden
6  2017-01-03 13:00:03.043450          2.9     De Bilt
7  2017-01-03 13:00:02.669401          7.3  Maastricht
8  2017-01-03 13:00:01.321898          5.1  Leeuwarden
9  2017-01-04 13:00:04.042015          0.1     De Bilt
10 2017-01-04 13:00:04.321564          6.8  Maastricht
11 2017-01-04 13:00:04.394866          2.1  Leeuwarden

Doe de volgende analyse op de datum gegevens.
-	Haal de eerste datumwaarde uit de tabel.
-	Bepaal van de eerste datumwaarden: jaar, maand, dag, uur, minuut en seconde.
-	Bepaal het tijdsverschil tussen de 1e en laatste waarde.
-	Bepaal van het tijdsverschil het aantal dagen.
-	Bepaal van het tijdsverschil het aantal uren.

In [268]:
d = df["datum"].loc[0]
d_year = d.year
d_month = d.month
d_day = d.day
d_hour = d.hour
d_min = d.minute
d_sec = d.second

print(d_year, d_month, d_day, d_hour, d_min, d_sec)
print(df["datum"].iloc[-1] - df["datum"].iloc[0])

2017 1 1 13 0 5
2 days 23:59:59.325144

De storingsmedewerker wil graag de volgende gegevens van dagen. Daarom is het handig om de dataframe te voorzien van een index. Voer dan de volgende opdrachten uit en verklaar deze.
-	Maak van de datum kolom een index.
-	De temperaturen op 1 januari.
-	De temperaturen na 3 januari.
-	De temperatuur gemiddeld per dag .
-	Leg nu zelf uit wat de functie shift() doet.
-	Haal de datum kolom index weer weg.

In [269]:
df.set_index("datum")
df[["temperatuur"]]

    temperatuur
0          -0.3
1           1.9
2           0.8
3           1.8
4           7.1
5           5.7
6           2.9
7           7.3
8           5.1
9           0.1
10          6.8
11          2.1

In [270]:
df[df["datum"] < pd.Timestamp("2017-01-02")]["temperatuur"]

0   -0.3
1    1.9
2    0.8
Name: temperatuur, dtype: float64

In [271]:
df[df["datum"] > pd.Timestamp("2017-01-03")]["temperatuur"]

6     2.9
7     7.3
8     5.1
9     0.1
10    6.8
11    2.1
Name: temperatuur, dtype: float64

In [272]:
df[["temperatuur"]].mean()

temperatuur    3.441667
dtype: float64

In [280]:
df.reset_index(drop=True, inplace=True)
df

    index                      datum  temperatuur    meetpunt
0       0 2017-01-01 13:00:05.069722         -0.3     De Bilt
1       1 2017-01-01 13:00:01.119994          1.9  Maastricht
2       2 2017-01-01 13:00:07.178768          0.8  Leeuwarden
3       3 2017-01-02 13:00:01.043200          1.8     De Bilt
4       4 2017-01-02 13:00:03.119401          7.1  Maastricht
5       5 2017-01-02 13:00:03.876898          5.7  Leeuwarden
6       6 2017-01-03 13:00:03.043450          2.9     De Bilt
7       7 2017-01-03 13:00:02.669401          7.3  Maastricht
8       8 2017-01-03 13:00:01.321898          5.1  Leeuwarden
9       9 2017-01-04 13:00:04.042015          0.1     De Bilt
10     10 2017-01-04 13:00:04.321564          6.8  Maastricht
11     11 2017-01-04 13:00:04.394866          2.1  Leeuwarden

In [279]:
df.shift()  # dit voegt een extra rij toe

    index                      datum  temperatuur    meetpunt
0     NaN                        NaT          NaN        None
1     0.0 2017-01-01 13:00:05.069722         -0.3     De Bilt
2     1.0 2017-01-01 13:00:01.119994          1.9  Maastricht
3     2.0 2017-01-01 13:00:07.178768          0.8  Leeuwarden
4     3.0 2017-01-02 13:00:01.043200          1.8     De Bilt
5     4.0 2017-01-02 13:00:03.119401          7.1  Maastricht
6     5.0 2017-01-02 13:00:03.876898          5.7  Leeuwarden
7     6.0 2017-01-03 13:00:03.043450          2.9     De Bilt
8     7.0 2017-01-03 13:00:02.669401          7.3  Maastricht
9     8.0 2017-01-03 13:00:01.321898          5.1  Leeuwarden
10    9.0 2017-01-04 13:00:04.042015          0.1     De Bilt
11   10.0 2017-01-04 13:00:04.321564          6.8  Maastricht